### Pandas

    Pandas is an open source, BSD-licensed library providing high-performance, easy-to-use data structures and data analysis tools for the python programming language

#### Agenda

What is Data Frames? - combination of atleast one row and one column (more than 1 row and 1 column)

What is Data Series? - series can either be 1 row or 1 column

Different operation in Pandas

In [1]:
## First step is to import pandas

import pandas as pd
import numpy as np

In [2]:
## Playing with dataframes
# read csv, after loading data it gets converted into dataframes - comibunation of both rows and columns 
# representation format - wherein how my data exactly looks like in excel

# Data
# index - row index values
# column index

df = pd.DataFrame(np.arange(0,20).reshape(5,4),index=['Row1','Row2','Row3','Row4','Row5'], columns = ["Column1","Column2","Column3","Column4"])

In [3]:
df.head()

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [25]:
df['Column3'] #fetch the column3

Row1     2
Row2     6
Row3    10
Row4    14
Row5    18
Name: Column3, dtype: int32

In [26]:
type(df['Column3'])

pandas.core.series.Series

In [27]:
# fetch multiple columns

df[['Column3','Column4']]

      Column3  Column4
Row1        2        3
Row2        6        7
Row3       10       11
Row4       14       15
Row5       18       19

In [4]:
# convert into excel

df.to_csv('Test1.csv')

In [5]:
## Accesing the elements
## 1.) .loc (focussing only on row index) 2.) .iloc(both row and columns)

df.loc['Row1'] # type is series - column name is represented as row indexes , no column indexes, only consider it as series

Column1    0
Column2    1
Column3    2
Column4    3
Name: Row1, dtype: int32

In [6]:
type(df.loc['Row1'])

pandas.core.series.Series

In [7]:
df.iloc[:,:]

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [11]:
# suppose I want only 2 rows

df.iloc[0:2,0:2] # In R indexing starts with 1 and in python it starts with 0

      Column1  Column2
Row1        0        1
Row2        4        5

In [12]:
type(df.iloc[0:2,0:2]) # type is dataframe as multiple rows and multiple columns

pandas.core.frame.DataFrame

In [13]:
df.iloc[0:2,0:1]

      Column1
Row1        0
Row2        4

In [14]:
type(df.iloc[0:2,0:1]) # dataframe because 2 rows and 1 column - always represnted in tabular format

pandas.core.frame.DataFrame

In [15]:
df.iloc[0:2,0] # now no column

Row1    0
Row2    4
Name: Column1, dtype: int32

In [16]:
type(df.iloc[0:2,0]) # became series as only we have row indexes

pandas.core.series.Series

In [8]:
## Take the elements from the column2

df.iloc[:,1:]

      Column2  Column3  Column4
Row1        1        2        3
Row2        5        6        7
Row3        9       10       11
Row4       13       14       15
Row5       17       18       19

In [18]:
## Convert Dataframe into array

# Basically it just skip the row and column indexes name

df.iloc[:,1:].values

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

In [19]:
df.iloc[:,1:].values.shape

(5, 3)

In [20]:
df.isnull().sum() # check NULL values

Column1    0
Column2    0
Column3    0
Column4    0
dtype: int64

In [23]:
df

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [22]:
# suppose in my column 1 categorical feature - to check how many unique categories

df['Column1'].value_counts()

0     1
4     1
8     1
12    1
16    1
Name: Column1, dtype: int64

In [24]:
df['Column1'].unique() # show how many unique values are there

array([ 0,  4,  8, 12, 16])